# InitializeFromBoundingBox Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCTransformSetter..::..InitializeFromBoundingBox Method
IFCTransformSetter Class See Also
---
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Transform InitializeFromBoundingBox(
	ExporterIFC exporterIFC,
	IList<GeometryObject> geometryList,
	IFCExtrusionCreationData exportBodyParams
)
```

Visual Basic
---
```text
Public Function InitializeFromBoundingBox ( _
	exporterIFC As ExporterIFC, _
	geometryList As IList(Of GeometryObject), _
	exportBodyParams As IFCExtrusionCreationData _
) As Transform
```

Visual C++
---
```text
public:
Transform^ InitializeFromBoundingBox(
	ExporterIFC^ exporterIFC,
	IList<GeometryObject^>^ geometryList,
	IFCExtrusionCreationData^ exportBodyParams
)
```

# ### Parameters
exporterIFC
    Type: Autodesk.Revit.DB.IFC..::..ExporterIFC
geometryList
    Type: System.Collections.Generic..::..IList<(Of <(<'GeometryObject>)>)>
exportBodyParams
    Type: Autodesk.Revit.DB.IFC..::..IFCExtrusionCreationData
# See Also
IFCTransformSetter Class
Autodesk.Revit.DB.IFC Namespace